app/controllers/devices_controller.rb

INSERT INTO "devices" ("patient_id", "ankle_angle", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["patient_id", 11], ["ankle_angle", 7], ["created_at", "2022-05-01 21:08:31.020301"], ["updated_at", "2022-05-01 21:08:31.020301"]]
---
    def create
        device = Device.create!(device_params)

UPDATE "devices" SET "sva" = $1, "brace" = $2, "footwear" = $3, "updated_at" = $4 WHERE "devices"."id" = $5
---
    def update
        device = find_device
        device.update(device_params)

SELECT "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def find_device
        Device.find(params[:id])