app/controllers/patients_controller.rb

INSERT INTO "patients" ("user_id", "created_at", "updated_at", "goal") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 3], ["created_at", "2022-04-28 18:47:50.053049"], ["updated_at", "2022-04-28 18:47:50.053049"], ["goal", "Full Gait Cycles"]]
---
    def create
        patient = @current_user.patients.create!(patient_params)

UPDATE "patients" SET "updated_at" = $1, "mmt" = $2 WHERE "patients"."id" = $3  [["updated_at", "2022-05-02 15:09:00.771144"], ["mmt", "Knee Flexion= 2/5, Knee Extension = 4/5, Dorsiflexion = 1/5, Plantarflexion = 1/5"], ["id", 12]]
---
    def update
        patient = find_patient
        render json: patient.update(patient_params), status: :ok

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
    def find_patient
        Patient.find(params[:id])